openfoam_cases/design_B_angled_guide/constant/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

viscosityModel  constant;
nu              [0 2 -1 0 0 0 0] 1.5e-05;
