openfoam_cases/design_B_angled_guide/system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.05;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent yes;

    residualControl
    {
        p       1e-4;
        U       1e-5;
        k       1e-5;
        omega   1e-5;
    }
}

relaxationFactors
{
    equations
    {
        U       0.7;
        k       0.6;
        omega   0.6;
    }
}
