openfoam_cases/design_B_angled_guide/system/meshQualityDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}

#includeEtc "caseDicts/mesh/generation/meshQualityDict"
minFaceWeight 0.02;
